package exam.vending_machine;

/**
 * Created by sjshin on 2016-03-16.
 * 텍스트로 메뉴를 보여주고
 *
 * 1. 콜라 2.사이다
 * C 거스름돈
 *
 * 메뉴금액은 다 달라야 하고 제일 작은 메뉴에 금액이 300원이면, 거스름돈이 300 미만이면 자동으로 반환. 300이상이면 계속 메뉴를 선택할 수 있어야 함.
 * 메뉴를 선택했을때 뽑았을때 주성분 표시, 주성분은 물 설탕 등이 있고 각메뉴마다 주성분이 다를 수 있다
 * 오랜지는 물 설탕 오렌지 액기스, 커피는 물 설탕 커피, 알로에는 물 설탕 알로에
 * 톤을 입력 받아서 음료 뽑는다.
 *
 *1. 최초로딩 시 메뉴 리스트를 보여 준다. 메뉴명:가격:주성분:선택가능여부N
 *2. 대기 했다가 돈이 입력이 되면, 선택한 메뉴 리스트 - 메뉴명:가격:주성분:선택가능여부N
 *3. 선택하거나 돈을 더 투입하거나
 *4.
 *
 * 음료클래스 -> 구체화된 하위 클래스 각 음료명
 */
public class test {
}
